In [1]:
import pandas as pd

In [3]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [4]:
store_items['bikes']

store 1    20
store 2    15
Name: bikes, dtype: int64

In [5]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [6]:
store_items.loc['store 1']

bikes      20.0
glasses     NaN
pants      30.0
watches    35.0
Name: store 1, dtype: float64

In [7]:
store_items.loc[['store 1', 'store 2']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [9]:
store_items['bikes']['store 1']

20

In [11]:
store_items['shirts'] = [20, 4]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      20
store 2     15     50.0      5       10       4

In [13]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      20     50
store 2     15     50.0      5       10       4      9

In [14]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [15]:
store_items = store_items.append(new_storeb)

/home/progrmoiz/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [16]:
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    20.0   50.0       35
store 2     15     50.0      5     4.0    9.0       10
store 3     20      4.0     30     NaN    NaN       35

In [22]:
store_items['new watches'] = store_items['watches'][1:]

In [23]:
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    20.0   50.0       35          NaN
store 2     15     50.0      5     4.0    9.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [25]:
store_items.insert(5, 'shoes', [8, 5, 2])

ValueError: cannot insert shoes, already exists

In [26]:
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new watches
store 1     20      NaN     30    20.0   50.0      8       35          NaN
store 2     15     50.0      5     4.0    9.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      2       35         35.0

In [27]:
store_items.pop('new watches')

store 1     NaN
store 2    10.0
store 3    35.0
Name: new watches, dtype: float64

In [32]:
store_items = store_items.drop(['shoes'], axis=1)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    20.0   50.0       35
store 2     15     50.0      5     4.0    9.0       10
store 3     20      4.0     30     NaN    NaN       35

In [33]:
store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 3     20      4.0     30     NaN    NaN       35

In [34]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  suits  watches
store 3    20      4.0     30     NaN    NaN       35

In [36]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits  watches
last store    20      4.0     30     NaN    NaN       35

In [40]:
print(store_items.set_index(['pants']))
store_items

       hats  glasses  shirts  suits  watches
pants
30       20      4.0     NaN    NaN       35

            hats  glasses  pants  shirts  suits  watches
last store    20      4.0     30     NaN    NaN       35